       >>source format is free
*>*********************************************************************

identification division.
program-id. cobmind.

*>*********************************************************************

procedure division.

display 'Hello, CobMind!'.
stop run.
